# 과제 5


4. 타이타닉 데이터의 결측치를 확인하세요. 
5. age의 결측값은 중위 값으로 대체하세요. 
6. embark_town의 결측 값은 최빈값으로 대체하세요. 
7. embarked 결측치는 embark_town의 첫 글자로 대체하세요 
8. deck 결측치는 backfill로 5개만 대체하세요. limit = 5 
9. df_t내에 범주형 변수를 원 핫 인코딩하여 더미변수로 만드세요

In [3]:
import pandas as pd
df = pd.read_csv('./data/titanic.csv')

In [2]:
## 1. 타이타닉 데이터의 결측치를 확인하세요

In [5]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
adult_male       0
embark_town      2
dtype: int64

## age 변수에 177개가 있음, embarked 2개, embark_town 2개

In [6]:
## 2. age의 결측값은 중위 값으로 대체하세요.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   adult_male   891 non-null    bool
 10  embark_town  889 non-null    object
dtypes: bool(1), float64(2), int64(4), object(4)
memory usage: 70.6+ KB

In [12]:
df["age"].fillna(df["age"].median(), inplace=True)
df.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
adult_male     0
embark_town    2
dtype: int64

In [13]:
## 3. embark_town의 결측 값은 최빈값으로 대체하세요.

In [16]:
df["embark_town"].fillna(df["embark_town"].describe()["top"], inplace=True)
df.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
adult_male     0
embark_town    0
dtype: int64

In [17]:
## 4. embarked 결측치는 embark_town의 첫 글자로 대체하세요

In [19]:
df["embarked"].fillna(df["embark_town"].str[0],inplace=True)
df["embarked"].value_counts()

S    646
C    168
Q     77
Name: embarked, dtype: int64

In [6]:
## 5. df_t내에 범주형 변수(embark_town,class) 를 원 핫 인코딩하여 더미변수로 만드세요

In [21]:
dum = pd.get_dummies(df, columns=["embark_town","class"])
dum

,survived,pclass,sex,age,sibsp,parch,fare,embarked,adult_male,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton,class_First,class_Second,class_Third
0,0,3,male,22.0,1,0,7.2500,S,True,0,0,1,0,0,1
1,1,1,female,38.0,1,0,71.2833,C,False,1,0,0,1,0,0
2,1,3,female,26.0,0,0,7.9250,S,False,0,0,1,0,0,1
3,1,1,female,35.0,1,0,53.1000,S,False,0,0,1,1,0,0
4,0,3,male,35.0,0,0,8.0500,S,True,0,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,True,0,0,1,0,1,0
887,1,1,female,19.0,0,0,30.0000,S,False,0,0,1,1,0,0
888,0,3,female,28.0,1,2,23.4500,S,False,0,0,1,0,0,1
889,1,1,male,26.0,0,0,30.0000,C,True,1,0,0,1,0,0
890,0,3,male,32.0,0,0,7.7500,Q,True,0,1,0,0,0,1